---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.EnterValueOrFormula
source: html/28c77b4b-4eff-8002-c17e-36e6612af330.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.EnterValueOrFormula Property

Enter a value or a formula starting with '='.

## Syntax (C#)
```csharp
public static FailureDefinitionId EnterValueOrFormula { get; }
```